app/views/events/_event.json.jbuilder

UPDATE "events" SET "avatar_file_name" = $1, "avatar_file_size" = $2, "avatar_updated_at" = $3, "updated_at" = $4 WHERE "events"."id" = $5  [["avatar_file_name", "poza.jpeg"], ["avatar_file_size", 8267], ["avatar_updated_at", 2017-05-29 04:39:56 UTC], ["updated_at", 2017-05-29 04:39:56 UTC], ["id", 4]]
---

json.update_url event_path(event, method: :patch)