app/controllers/events_controller.rb

  def index
    @events = Event.where(start: params[:start]..params[:end])
---
SELECT "events".* FROM "events" WHERE ("events"."start" BETWEEN $1 AND $2)  [["start", "2017-03-26"], ["start", "2017-05-07"]]

  def show
    @event = Event.find(params[:id])
    @user = Testuser.find(@event.user_id)
    @reservation = Reservation.find_by(user_id: current_testuser.id, event_id: @event.id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "testusers".* FROM "testusers" WHERE "testusers"."id" = $1 ORDER BY "testusers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1 AND "reservations"."event_id" = $2 LIMIT $3  [["user_id", "1"], ["event_id", "1"], ["LIMIT", 1]]

  def create
    @event = Event.new(event_params)
      #respond_to do |format|
    if @event.save
---
INSERT INTO "events" ("title", "description", "seats", "start", "end", "color", "user_id", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    @event.update(event_params)
---
UPDATE "events" SET "avatar_file_name" = $1, "avatar_file_size" = $2, "avatar_updated_at" = $3, "updated_at" = $4 WHERE "events"."id" = $5  [["avatar_file_name", "poza.jpeg"], ["avatar_file_size", 8267], ["avatar_updated_at", 2017-05-29 04:39:56 UTC], ["updated_at", 2017-05-29 04:39:56 UTC], ["id", 4]]

  def destroy
    @event.avatar = nil

    #respond_to do |format|
     # if @event.destroy
    #format.html {redirect_to '', notice: 'Event was successfully deleted.' }
    #  end
    #end
    @event.destroy
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]