app/controllers/home_controller.rb

SELECT "events".* FROM "events"
---
  def my_events
  	# to do: evenimentele create de user + evenimentele marcate cu rezervat + evenimentele marcate cu interested
  	@events=Event.all