app/controllers/reservations_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "seats" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["seats", -1], ["updated_at", 2017-05-30 03:06:54 UTC], ["id", 1]]
INSERT INTO "reservations" ("is_going", "event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["is_going", "true"], ["event_id", "2"], ["user_id", "1"], ["created_at", 2017-05-30 03:53:09 UTC], ["updated_at", 2017-05-30 03:53:09 UTC]]
---
	def create
		@reservation = Reservation.new(reservation_params)
        @event = Event.find(@reservation.event_id)
        @event.seats -=1
        @event.update_attribute(:seats,@event.seats)
		if @reservation.save

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "events" SET "seats" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["seats", 100], ["updated_at", 2017-05-30 05:15:41 UTC], ["id", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 1]]
---
	def destroy
		@reservation = Reservation.find(params[:id])
		@event = Event.find(@reservation.event_id)
        @event.seats +=1
        @event.update_attribute(:seats,@event.seats)
        if @reservation.destroy