app/controllers/user_sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "8"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "is_student", "is_teacher", "is_management", "is_admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    omniauth = env['omniauth.auth']
    logger.debug "+++ #{omniauth}"

    user = User.find_by_uid(omniauth['uid'])
    if not user
      # New user registration
      user = User.new(:uid => omniauth['uid'])
    end
    user.first_name = omniauth['extra']['first_name']
    user.last_name  = omniauth['extra']['last_name']
    user.email = omniauth['extra']['email']
    user.is_student  = omniauth['extra']['student']
    user.is_teacher = omniauth['extra']['teacher']
    user.is_management  = omniauth['extra']['management']
    user.is_admin = omniauth['extra']['admin']
    user.last_name  = omniauth['extra']['last_name']
    #notificarile sunt active implicit
    user.notification = 'true';
    user.save